Repository: 84000/data-translation-memory
Catalog: toh4568-3-v3.tmx
Source language: bo
Languages: en

source: ང་རྒྱལ་མ་མཆིས་འགྱིང་དང་བྲལ་བས་བྲན་མོ་བཞིན། །སྒྲ་དྲི་རོ་ལ་མ་ཆགས་ཆང་ལ་མ་ཆགས་ཏེ། །འདོད་བྲལ་བརྣབ་སེམས་མ་མཆིས་རང་གི་ནོར་གྱིས་འཚལ། །
en: She should comport herself fittingly.She should be without any pride or willfulness, like a servant.She should not be attracted to alcohol, tastes, sounds, or fragrances;She should be free of greed and covetousness, satisfied with her fortune.

source: བདེན་ལ་གནས་ཤིང་མི་འཕྱར་གཡེང་བ་མ་ལགས་པ། །ངོ་ཚའི་གོས་འཚལ་རྒོད་དང་ཁེངས་པ་མ་མཆིས་གནས། །
en: “Adhering to truth, she should be steady and unwavering;Not puffed up, she should dress with modesty.

source: ལྟ་དང་བཀྲ་ཤིས་མ་ཆགས་རྟག་ཏུ་ཆོས་ལ་བརྩོན། །ཞེས་གསུངས་པའི་ཚུལ་དང་མཐུན་པ།
en: Always engaging in righteousness, she should be unimpressed with flashy displays.”

source: དེ་བཞིན་དུ་མ་སུ་རཀྵས།
en: His ministers accord with the words of Masurakṣa:

source: ཚིག་གསལ་བློ་ནི་ཕུན་སུམ་ཚོགས། །ལུགས་ཀྱི་བསྟན་བཅོས་དག་ལ་མཁས། །ངང་འཇམ་དཔྱོད་པར་བྱེད་པ་སྟེ། །རྒྱལ་པོའི་བློན་པོ་དེ་འདྲས་བྱ། །ཞེས་བཤད་པ་ལྟ་བུའི་བློན་པོ་དང་།
en: “Clear in speech, abundant in intelligence,Well versed in the treatises on ethics,Gentle in character yet scrutinizing,Just so should royal ministers conduct themselves.”

source: ཚེ་ཡི་རིག་བྱེད་གོམས་པ་དང་། །
en: His doctors are in accord as well:

source: ཆོས་རིག་ཡིད་འོང་སྙན་སྨྲ་ཞིང་། །ཆོ་ག་ངང་ཚུལ་ཕུན་སུམ་ཚོགས། །ཐང་ལ་འབར་བཞིན་གསོ་མཁས་ཤིང་། ནད་ཀྱི་མཚན་ཉིད་ཀུན་ལ་མཁས། །རྒྱལ་པོ་དེ་འདྲའི་སྨན་པ་བསྟེན། །
en: “Acquainted with the art of healing,Eloquently conversant in both Dharma and learning,Well trained in the practical applications,Skilled in healing just like Dhanvantari, And well versed in all signs of disease—Such is the doctor a king should see.”

source: ཞེས་པ་ལྟ་བུའི་སྨན་པ་དང་།
en: His secretaries are in accord as well:

source: སྒྲ་རིག་རྩིས་ཀྱང་ཤེས་པ་སྟེ། །ཡི་གེ་བྱང་ཞིང་ལག་པ་མྱུར། །ཡིད་གཞུང་ཚིག་ནི་གསལ་བ་དང་། །གྲགས་དང་སྦྱིན་ལྡན་ཡི་གེ་པ། །
en: “Knowledgeable in grammar and astrology,Clear in penmanship and swift in hand,Intelligent and clear with words—Such a scribe will be rich and renowned.”

source: ཞེས་པ་ལྟ་བུའི་དྲུང་ཡིག་པ་དང་།
en: His chief ministers are in accord as well:

source: རིགས་དང་ངང་ཚུལ་ཡོན་ཏན་ལྡན། །བདེན་དང་ཆོས་ལ་མཆོག་ཏུ་གཞོལ། །གཟུགས་བྱད་ཤིན་ཏུ་བཟང་བ་ནི། །རྒྱལ་པོའི་སྤྱན་མི་ཡིན་པར་བཤད། །
en: “Of noble birth, excellent disposition, and talented,Diligent in the pursuit of truth and Dharma,And dignified in physical appearance—Such are advisors fit for a king.”

source: ཅེས་པ་ལྟ་བུའི་ནང་བློན་རྣམས་དང་།
en: His military commanders are in accord as well:

source: མཚོན་ལ་གོམས་ཤིང་ནུས་དང་ལྡན། །བཞོན་པ་དག་ལ་བྱ་བཞིན་གོམས། །དཔའ་ཞིང་བརྟན་པ་ཕུན་སུམ་ཚོགས། །དེ་འདྲ་དམག་དཔོན་ཡིན་པར་ཤེས། །
en: “Trained in weaponry and endowed with strength,Trained in riding like a bird,Brimming with courage and resolution—Understand this is how commanders ought to be.”

source: ཞེས་པ་ལྟ་བུའི་དམག་དཔོན་དང་།
en: His chefs are in accord as well:

source: ཕ་མེས་རྒྱུད་བྱུང་གྲིམས་པར་ཤེས། །བསྟན་བཅོས་རིག་ཅིང་ཞིམ་པར་འཚེད། །གཙང་སྦྲ་ཆེ་ཞིང་སྙིང་ཉེ་བ། །དེ་ལྟ་བུ་ཡིས་ཕྱག་ཚང་བྱ། །
en: “Privy to ancestral traditions and dexterous, Learned in treatises and skilled in cooking,Hygienic and full of affection—This is how a chef should be.”

source: ཞེས་པ་ལྟ་བུའི་ཕྱག་ཚང་པ་དང་།
en: His envoys are in accord as well:

source: ཡིད་གཞུངས་ཚིག་གསལ་ཤེས་རབ་ལྡན། །གཞན་སེམས་ཉེ་བར་མཚོན་ནུས་དང་། །བརྟན་ཞིང་ཇི་སྐད་བསྒོ་བཞིན་སྨྲ། །རྒྱལ་པོའི་ཕོ་ཉ་དེ་འདྲས་བྱ། །
en: “Intelligent, articulate, and wise,Able to relate to the thinking of others,Resolute, and who speak as commanded—Such should the royal messengers behave.”

source: ཞེས་པ་ལྟ་བུའི་མངག་གཞུག་པ་སོགས་མདོར་ན་བསྟན་བཅོས་དང་མཐུན་པའི་རྒྱལ་པོའི་ཡན་ལག་རྣམས་ཀྱང་ལེགས་པར་ཚང་བ་ཡིན་ནོ། །
en: In short, he is well endowed with all aspects of a king in accord with the treatises.

source: རྩ་བའི་ས་བཅང་གཉིས་པ་རྒྱལ་བའི་གསུང་རབ་པར་དུ་འཁོད་པའི་རྣམ་དཀར་གྱི་བྱ་བ་དངོས་སྨོས་པ་ལ།
en: The Virtuous Activity of Publishing the Victorious One’s Teachings

source: བཞེངས་པའི་དུས་དང་།
en: Part 2

source: ཕྱི་མོ་ཇི་ལྟར་བསགས་ཤིང་དག་པར་བགྱིས་པའི་ཚུལ་དང་།
en: The virtuous activity of publishing the Victorious One’s teachings will be explained according to the time of production, the process of collecting and editing the manuscripts, and the practicalities of printing.

source: བཞེངས་ཚུལ་དངོས་སོ། །
en: 2.1 The Time of the Production of the Kangyur

source: དང་པོ་ནི། སྤྱིར་བསྐལ་པ་ཆེན་པོ་བཟང་པོ་འདི་ལ་ཆགས་པའི་དུས་དང་། གནས་པའི་དུས་དང་། འཇིག་པའི་དུས་དང་གསུམ་གནས་པའི་བསྐལ་པ་དེ་ལའང་ཡ་ཐོག་རིང་མོ་དང་།
en: In general, this great Fortunate Eon is made up of three phases: the age of formation, the age of remaining, and the age of destruction.

source: མ་ཐོག་རིང་མོ་དང་། བར་གྱི་ཁུག་པ་བཅོ་བརྒྱད་དུ་གྲགས་པ་སྟེ་བར་བསྐལ་ཉི་ཤུ་ཡོད་པ་ལས།
en: Within the age of remaining, there are twenty intermediate periods: the long decline, the long rise, and the eighteen cyclical periods between.

source: ཡ་ཐོག་རིང་མོའི་གཤམ་གྱི་དུས་ཏེ།
en: Currently, we are in the later part of the long decline.

source: དེའང་ཐུབ་པའི་བསྟན་པ་ལུང་གི་དུས་ཀྱི་ལྔ་བརྒྱ་བ་ཕྲག་གསུམ་ལས་དཀྱིལ་སྨད་ཙམ་དུ་ཕྱིན་པ་བདག་ཅག་གི་སྟོན་པ་རྣམ་འདྲེན་བཞི་བ་ཤཱཀྱའི་དབང་པོ་ས་དེ་ཉིད་ཞིང་འདིའི་ངོ་སྐལ་གྱི་སྤྲུལ་པའི་སྣང་བརྙན་ཉེ་བར་བསྟན་ནས་ད་ལྟའི་བར་གྱི་འདས་ལོའི་ཚུལ་ལ་མཁས་པ་དག་གིས་དཔྱད་པས་བཞེད་པ་མི་མཐུན་པ་མང་དུ་བྱུང་བ་ལས།
en: In terms of the stages of the existence of the Sage’s teachings, which are divided into groups of three 500-year periods, we are now in the latter half. Learned people have come to many conflicting conclusions regarding the number of years that have elapsed since our Teacher, the Fourth Guide, the Lord of the Śākyas, displayed his emanation in our world.

source: དེང་སང་ཡོངས་སུ་གྲགས་པ་པད་དཀར་ཞལ་ལུང་པའི་ལུགས་ཀྱིས་སྟོན་པ་དྲག་པོ་ལྕགས་སྤྲེལ་ས་ག་ཟླ་བའི་ཚེས་བདུན་ཟླ་སྐར་རྒྱལ་གྱི་དུས་སུ་སྐུ་བལྟམ་པ་ནས། བགྲང་བྱ་ཉིས་སྟོང་དང་དྲུག་བརྒྱ་བརྒྱད་ཅུ་རྩ་དགུ་འདས་ཤིང་།
en: According to the tradition of The White Lotus Instructions, which is commonly used today, our teacher was born 2,689 years ago in the year of Raudra, the male iron monkey year (960 bce), on the seventh day of the month of Viśakhā, in the hour of Puṣya;

source: རྒྱལ་བ་ཤིང་རྟ་ས་ག་ཟླ་བའི་བཅོ་ལྔ་ལ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: he reached perfect awakening 2,655 years ago in the year of Jaya, the wood horse year (926 bce), on the fifteenth day of the month of Viśakhā;

source: ལོ་དེའི་ཆུ་སྟོད་ཅན་གྱི་ཚེས་བཞིར་ལྔ་སྡེ་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས་ཉིས་སྟོང་དྲུག་བརྒྱ་ལྔ་བཅུ་རྩ་ལྔ་འདས་པ།
en: and, in that same year, on the fourth day of the month of Pūrvāṣādhā, he turned the wheel of Dharma for the five disciples.

source: དེ་བཞིན་དུ་ལྕགས་འབྲུག་ནག་ཉ་ས་ག་ཟླ་བའི་ཚེས་བཅོ་ལྔའི་གུང་ཐུན་ལ་དགོངས་པ་ཞི་དབྱིངས་སུ་མནལ་བའི་ཚུལ་བསྟན་ནས་ཉིས་སྟོང་དྲུག་བརྒྱ་དགུ་འདས་ཤིང་།
en: Then, 2,609 years ago, at midday on the day of the full moon, the fifteenth day of Viśakhā in the iron dragon year (880 bce), he displayed the reclining posture with his mind passing into the expanse of peace.

source: ཆོས་རྗེ་ས་སྐྱ་པའི་ལུགས་ཀྱིས་སྟོན་པ་རྣམ་འབྱུང་ས་འབྲུག་ལ་སྐུ་བལྟམ་ཞིང་། ཐམས་ཅད་འདུལ་ས་ཕག་ལོར་གཤེགས་ནས་སུམ་སྟོང་བརྒྱད་བརྒྱ་དྲུག་ཅུ་རྩ་གཅིག་འདས་པ།
en: Alternatively, the tradition of the Dharma Lord Sakya Paṇḍita holds that our teacher was born 3,861 years ago in the year of Vibhava, the earth dragon year (2132 bce), and passed away in the year of Sarvajit, the earth pig year (2039 bce).

source: ཁ་ཆེ་པཎ་ཆེན་ཤཱཀྱ་ཤྲཱིའི་ལུགས་ཀྱིས་མེ་མོ་སྦྲུལ་ལ་སྐུ་བལྟམ་ཞིང་མེ་བྱི་ལོར་གཤེགས་ནས་ཉིས་སྟོང་ཉིས་བརྒྱ་བདུན་ཅུ་དོན་གཅིག་འདས་པ།
en: In the tradition of the Kashmiri scholar Śākyaśrī, our teacher was born 2,271 years ago in the female fire snake year (542 bce) and passed away in the fire mouse year (463 bce).

source: ཇོ་བོ་རྗེ་དཔལ་ལྡན་ཨ་ཏི་ཤའི་བཞེད་པས་ཤིང་མོ་གླང་ལ་སྐུ་བལྟམ་ཞིང་ཤིང་སྤྲེལ་ལ་གཤེགས་པའི་ཚུལ་བསྟན་ནས་སུམ་སྟོང་བརྒྱད་བརྒྱ་དྲུག་ཅུ་རྩ་བཞི་འདས་པ།
en: According to the glorious lord Atiśa, the Buddha was born 3,864 years ago in the female wood ox year (2135 bce) and passed away in the wood monkey year (2056 bce).

source: སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་གནམ་སྐོས་གོང་མ་ཆེན་པོ་གཡུང་ཅིན་གསེར་ཁྲིར་ཕེབས་ནས་ཉག་མ་བདུན་ཐལ་བ།
en: Regardless, the production of this Kangyur began seven years after the powerful sovereign, the great, divinely mandated emperor Yongzheng, assumed the golden throne.

source: མིའི་དབང་པོ་འདི་ཉིད་དགུང་ལོ་ལྔ་བཅུ་རྩ་གཉིས་སུ་ཕེབས་པ།
en: This was when the Lord of Men, Tenpa Tsering, had reached fifty-two years of age.

source: བདེ་མཆོག་སྟོད་འགྲེལ་ལྟར་ན་སཽ་མྱ་ཞེས་པ་ཞི་བར་གྲགས་ཤིང་། ཤར་ཕྱོགས་ཏོང་ཀུའི་རྒྱལ་ཁམས་སུ་གྱི་ཡེའུར་བོད་པ་ས་མོ་བྱའི་ལོ་སྨེ་ཕྲེང་དང་པོ་འབྱུང་བ་སུམ་ལྡན་ཕུར་བུ་ཀླུང་དུ་ཞུགས་པའི་དུས།
en: According to The Follow-Up Tantra to the Cakrasaṃvara, this year is called saumya, meaning “gentle.” In the eastern kingdom of China, it is called the year of the earth rooster, and in the Tibetan calendar, it is known as the female earth bird year (1729) in the first inner cycle, when three elements are in convergence, and when Jupiter is at its nadir.

source: དེ་ལའང་ཉི་མ་ལྷོར་བསྒྲོད་པ་དང་བྱང་དུ་བསྒྲོད་པའི་དུས་གཉིས་ཡོད་པ་ལས་སྔ་མ།
en: Furthermore, between the southward and northward declinations of the sun, this work was begun during the former.

source: པའི་ཡོན་ཏན་དང་ལྡན་པ་སྟོན་ཀའི་དུས། དགུན་དང་དཔྱིད་དང་དབྱར་དང་དབྱར་ཐུང་དང་དབྱར་རིང་པོ་སྟེ་དུས་ལྔ་ལས་ཕྱི་མ།
en: Among the four seasons of summer, winter, autumn, and spring, it was autumn, the season when all desirable things are in abundance. In the framework of the five seasonal periods of winter, spring, summer, short summer, and long summer, the production began in the last of those five.

source: ཟླ་བ་བཅུ་གཉིས་ལས་ཧོར་ལུགས་ཀྱི་ཟླ་བ་བདུན་པར་གྲགས་པ།
en: According to the Mongolian calendar, it was started in the seventh of the twelve months, while according to the Chinese tradition, it was in the first month of autumn, the month of the monkey.

source: ཏོང་ཀུའི་རྒྱལ་ཁམས་པའི་ལུགས་ཀྱིས་སྟོན་ར་བ་སྤྲེའུའི་ཟླ་བ། འཕགས་པའི་ཡུལ་དུ་ཤྲབཎར་གྲགས་པ་རྒྱུ་སྐར་གྲོ་བཞིན་གྱིས་ཉ་བའི་དཀར་ཕྱོགས། གང་བ་གཉིས་པའི་ཚེས།
en: It was on the second day of the period when the moon was waxing in the constellation Droshin, which is known as Śrāvaṇa in the noble land of India.

source: རེས་གཟའ་མཛའ་ལྷའི་གྲོགས་པོའི་འཛུམ་མདངས་རྒྱུ་སྐར་གྱི་ལྷ་མོ་ཨ་ནུ་རཱ་དྷཱའི་བཞིན་གྱི་པདྨོར་འཕོས་པ།
en: It was when Friday’s friendly smile was shining on the lotus face of the goddess of the constellation Anurādhā.

source: འཆི་མེད་གྲུབ་པའི་སྦྱོར་བ།
en: The conjunction of the day was “immortality.”

source: དུས་འཁོར་བའི་ལུགས་ཀྱི་དབྱངས་ཨོ། གསལ་བྱེད་ཕོ། འབྱུང་བ་ཆུ། འདོད་ཡོན་གཟུགས།
en: In the tradition of the Kālacakra, the vowel was o, the consonant was pho, the element was water, and the sense object was form.

source: དབྱངས་འཆར་བའི་ལུགས་ཀྱི་དབྱངས་ཨེ། གསལ་བྱེད་ར། འབྱུང་བ་རླུང་།
en: In the tradition of the Svarodaya, the vowel was e, the consonant was ra, the element was wind, the sense object was touch.

source: འདོད་ཡོན་རེག་བྱ་སོགས་འཆར་བའི་དུས་ཕུན་སུམ་ཚོགས་པ་ལ།
en: It was a perfect time when all of these astrological signs appeared.

source: ས་སྐྱོང་ཆེན་པོས་ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པའི་ལེགས་བྱས་ཀྱི་མཐུ་རྒྱ་ཆེན་པོ་བརྟས་པ་ལས་སླར་ཡང་ལེགས་བྱས་ཀྱི་ལམ་རྒྱ་ཆེན་པོ་འདི་ལྟ་བུ་བསྒྲུབ་པ་ལ་སྤྲོ་བ་ཆེན་པོ་ཟླ་བ་མཐོང་བའི་རྒྱ་མཚོ་བཞིན་དུ་འཕེལ་བར་གྱུར་ཏེ།
en: This great ruler has accrued so many good deeds since beginningless time that their enormous power has come to fruition in the form of accomplishing the vast good deed of this endeavor, at which great joy swells like Somadarśana’s ocean.

source: རྒྱ་ཆེན་པོའི་གནས་འདི་ལྟ་བུ་ལ་སྤྱོད་མི་ནུས་སོ་སྙམ་པའི་ཞུམ་པ་དང་། གནས་འདི་ཚེགས་ཀྱིས་སྤྱད་པ་གཞན་གྱིས་བསྒྲུབ་མི་ནུས་པས་བདག་ཉིད་ཁོ་ན་མཆོག་ཡིན་གྱི་གཞན་དག་ནི་སྦྲང་བུ་ལྟ་བུའོ་སྙམ་པའི་ཁེངས་པ་དང་།
en: He was never discouraged by thoughts such as, “I cannot accomplish such a vast undertaking as this.” Nor did he entertain arrogant thoughts like, “This undertaking is so difficult that others would never be able to accomplish it.

source: འདི་ལྟ་བུ་སྤྱད་པར་འོས་པ་ཡིན་མོད་ཀྱི་འོན་ཀྱང་རྒྱུ་འདི་ལས་མཛོད་དང་བང་བ་རྣམས་ཧ་ཅང་འབྲི་བར་འགྱུར་རོ་སྙམ་པའི་སེར་སྣ་ལ་སོགས་པ་རིང་དུ་སྤངས་ནས། བདུད་དང་བདུད་ཀྱི་རིས་དག་གིས་དངོས་དང་བརྒྱུད་ནས་བར་ཆད་རྩོམ་ཞིང་ཐབས་དུ་མས་བཤོལ་བར་བྱེད་ཀྱང་སྙིང་སྟོབས་ཀྱི་གོ་ཆ་ལྷོད་པར་མི་འགྱུར་བའི་བརྟན་པའི་བློ་གྲོས་ཆེན་པོས་ཐོག་མར་མགོ་རྩོམ་པའི་ལས་ཀྱི་གྲྭ་འཛུགས་པར་མཛད་ཡིན་ནོ། །
en: I am supreme while all others are mere insects.” He likewise did not have miserly thoughts such as, “This may be a worthy undertaking, but it will drain my treasury and stores.” Having cast away such thoughts, he donned the armor of courageous spirit and, with the unrelenting resolve of his great intelligence, he initiated the work on this great project, heedless of the obstacles that Māra and his armies would erect, directly and indirectly, and the variety of methods they would use to cause delays.

source: གཉིས་པ་ནི་བྱ་བ་ལས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་དེའི་ཐོག་མར་ཡི་གེའི་ཕྱི་མོ་རྣམ་པར་དག་པ་བསགས་ནས་ཞུས་དག་མཛད་པ་ཡིན་ཏེ།
en: 2.2 The Manner in Which Source Texts Were Collected and Edited This great wheel of activity began with the collection and subsequent editing of authentic source texts.

source: དེའང་གཙོ་བོར་དེང་སང་གངས་རིའི་ཁྲོད་འདིར་གྲགས་ཆེ་བ་ཚལ་པ་བཀའ་འགྱུར་དང་།
en: Currently, the editions that are most well known amid the snow mountains are those derived from the Tshalpa Kangyur and those derived from the Gyantsé Thempangma.

source: རྒྱལ་རྩེ་ཐེམ་སྤང་མར་གྲགས་པ་གཉིས་ཀྱི་རྒྱུན་ཡིན་པས་དེའི་ཁུངས་བཙལ་ཞིང་ཞུས་དག་གིས་གཏན་ལ་ཕབ་པའི་ཚུལ་ནི།
en: Their provenance and the editing processes through which they were established are as follows.

source: བསྟན་པ་སྔ་དར་གྱི་དུས་སུ་ཆོས་ཀྱི་རྒྱལ་པོ་སད་ན་ལེགས་མཇིང་ཡོན་གྱི་སྐུ་རིང་ལ། ལོ་ཙཱ་བ་བནྡེ་དཔལ་བརྩེགས་རཀྴི་ཏ། ཆོས་ཀྱི་སྙིང་པོ། དེ་ཝེནྡ། དཔལ་གྱི་ལྷུན་པོ་སོགས་ཀྱིས་འཕང་ཐང་ཀ་མེད་ཀྱི་གཙུག་ལག་ཁང་དུ་བཞུགས་པའི་གསུང་རབ་རྣམས་ལ།
en: During the reign of the Dharma King Senalek Jingyön, in the period of the early spread of Buddhism, the translators Bandé Paltsek Rakṣita, Chökyi Nyingpo, Devendra, Palgyi Lhunpo, and others cataloged the scriptures housed in the monastery of Phangthang Kamé.

source: ཚེག་བར་བརྒྱད་བརྒྱད་ལ་ཚིག་རྐང་རེ་རེ། དེ་བཞི་ལ་ཤློ་ཀ །དེ་སུམ་བརྒྱ་ལ་སོགས་པ་ལ་བམ་པོའི་ཚད་དུ་བྱས་ཏེ་གྲངས་དེས་གཞལ་བའི་ཐེམ་བྱང་མ་འཁྲུལ་བར་ཆོས་ཚན་འདི་དང་འདི་ལ་གྲངས་འདི་དང་འདིའོ་ཞེས་བཀོད་པ་དཀར་ཆག་འཕང་ཐང་མར་གྲགས་པ་སྟེ།
en: Counting eight syllables as a line, four lines as a stanza, and three hundred stanzas as a fascicle, they were able to establish the length of given Dharma scriptures based on an accurate system of accounting.

source: གངས་ཅན་འདིར་རྒྱལ་བའི་བཀའ་འགྱུར་རོ་ཅོག་ཕྱོགས་གཅིག་ཏུ་བསྒྲིགས་པའི་ཐོག་མ་ནི་འདི་ཡིན་ནོ་ཞེས་ཡོངས་སུ་གྲགས་ལ།
en: This became known as the Phangthangma catalog and is widely understood to be the first time that the translated words of the Victorious One were gathered into a single collection in this Land of Snows.

source: དེའི་རྗེས་སུ་ལོ་ཙཱ་བ་དཔལ་བརྩེགས་དང་། འཁོན་ནཱ་གེནྡྲ་རཀྵི་ཏ་སོགས་ཀྱིས་སྟོང་ཐང་ལྡན་དཀར་གྱི་ཕོ་བྲང་ཆེན་པོ་ན་བཞུགས་པའི་གསུང་རབ་ཞུས་ཆེན་མཛད་ཟིན་པ་རྣམས་ཕྱོགས་གཅིག་ཏུ་བསྒྲིགས་ནས་དཀར་ཆག་མཛད་པ་ལ་ལྡན་དཀར་མར་གྲགས་པ་བྱུང་།
en: Later, the translators Paltsek, Khön Nāgendra Rakṣita, and others collected those scriptures that had already been officially edited and housed in the great palace of Tongthang Denkar into a single collection, and they made a catalog that became known as the Denkarma.

source: དེའི་རྗེས་སུ་བཙན་པོ་ཁྲི་ལྡེ་སྲོང་བཙན་རལ་པ་ཅན་གྱི་སྐུ་རིང་ལ་ཕོ་བྲང་འོན་ལྗང་རྡོ་རྒྱ་ཕུབས་དགུ་ཐོག་མར་སྔོན་རྒྱལ་བའི་གསུང་རབ་བསྒྱུར་བ་རྣམས་སྐད་གསར་བཅད་ཀྱིས་གཏན་ལ་ཕབ་པ་དང་གསར་དུའང་མང་པོ་བསྒྱུར་ཏེ་སྒྲ་སྦྱོར་བམ་གཉིས་སུ།
en: Following that, during the reign of the emperor Tri Desongtsen Ralpachen, in the nine-story palace with a pagoda roof at Önchang Do, the older translations of the Buddha’s words were emended to conform with the new lexical standards, and many scriptures were also newly translated. It states in The Two-Volume Lexicon:

source: ཉི་འོག་གི་མཁན་པོ་ཨཱ་ཙཱརྱ་ཛི་ན་མི་ཏྲ་དང་། སུ་རེནྡྲ་བྷོ་དྷི་དང་།
en: “It was instructed that preceptors from western lands such as Ācārya Jinamitra, Surendrabodhi, Śīlendrabodhi, Dānaśīla, and Bodhimitra;

source: ཤཱི་ལེནྡྲ་བྷོ་དྷི་དང་། དཱ་ན་ཤཱི་ལ་དང་། བོ་དྷི་མི་ཏྲ་དང་། བོད་ཀྱི་མཁན་པོ་རཏྣ་རཀྵི་ཏ་དང་། དྷརྨ་ཏཱ་ཤཱི་ལ་དང་།
en: the Tibetan preceptors Ratnarakṣita and Dharmatāśīla;

source: ལོ་ཙཱ་བ་མཁས་པར་ཆུད་པ་ཛྙཱ་ན་སེ་ན་དང་། ཛ་ཡ་རཀྵི་ཏ་དང་། མཉྩ་ཤྲཱི་ཝརྨ་དང་།རཏྣནྡྲ་ཤཱི་ལ་ལ་སོགས་པས་ཐེག་པ་ཆེ་ཆུང་ལས་བྱུང་བའི་རྒྱ་གར་གྱི་སྐད་ལས་བོད་ཀྱི་སྐད་དུ་བསྒྱུར་ཅིང་མིང་དུ་བཏགས་པ་རྣམས་དཀར་ཆག་ཏུ་བྲིས་ཏེ། ནམ་དུ་ཡང་གཞུང་ལུགས་དེ་ལས་མི་བསྒྱུར་ཞིང་ཀུན་གྱིས་བསླབ་ཏུ་རུང་བར་གྱིས་ཤིག་ཅེས་བཀའ་སྩལ་ནས། སྔོན་ལྷ་སྲས་ཡབ་ཀྱི་རིང་ལ། ཨཱ་ཙཱརྱ་བོ་དྷི་ས་ཏྭ་དང་། ཡེ་ཤེས་དབང་པོ་དང་།
en: and the skilled translators Jñānasena, Jayarakṣita, Mañjuśrīvarman, Ratnendraśīla, and others write an inventory of the terminologies of the Greater and Lesser Vehicles as translated from Indic languages into Tibetan, and that ‘translations will never deviate from these conventions, which should be made so that they are suitable for everyone to study.’

source: ཞང་རྒྱལ་ཉེན་ཉ་བཟང་དང་། བློན་ཁྲི་བཞེར་སང་ཤི་དང་། ལོ་ཙཱ་བ་ཛྙཱ་དེ་ཝ་ཀོ་ཥ་དང་། ཅེ་ཁྱི་འབྲུག་དང་། བྲམ་ཟེ་ཨཱ་ནནྡ་ལ་སོགས་པས་ཆོས་ཀྱི་སྐད་བོད་ལ་མ་གྲགས་པ་ལས་མིང་དུ་བཏགས་པའི་དག་ཅིག་མཆིས་པའི་ནང་ནས། ཁ་ཅིག་ཆོས་ཀྱི་གཞུང་དང་།
en: “Prior to this, during the reign of the father of the [present] Divine Son, Ācārya Bodhisattva, Yeshé Wangpo, Shang Gyalnyen Nyasang, the minister Trisher Sangshi, the translator Jñānadevakośa, Che Khyidruk, Brahmin Ānanda, and others, since the Dharma language was unknown in Tibet at that time, had assigned certain terms, some of which did not accord with the Dharma scriptures and some of which did not accord with Sanskrit grammatical conventions.

source: བྱཱ་ཀ་ར་ཎའི་ལུགས་དང་མི་མཐུན་ཏེ། མི་བཅོས་སུ་མི་རུང་བ་རྣམས་ཀྱང་བཅོས། སྐད་ཀྱི་མིང་གཅེས་སོ་འཚལ་གྱིས་ཀྱང་བསྣན་ནས།
en: So those terms that required correction have been corrected, and terms of critical importance have been added.

source: ཐེག་པ་ཆེ་ཆུང་གི་གཞུང་ལས་ཇི་ལྟར་འབྱུང་བ་དང་།གནའི་མཁན་པོ་ཆེན་པོ་ནཱ་ག་རྫུ་ན་དང་། བ་སུ་བནྡྷུ་ལ་སོགས་པས་ཇི་ལྟར་བཤད་པ་དང་། བྱཱ་ཀ་ར་ཎའི་སྒྲའི་ལུགས་ལས་ཇི་སྐད་དུ་འདྲེན་པ་དང་ཡང་བསྟུན་ཏེ།
en: These terms have thereby been brought into conformity with the way they appear in the scriptures of the Greater and Lesser Vehicles, the way they are explained by the great scholars of the past such as Nāgārjuna, Vasubandhu, and so forth, as well as the way they are presented in grammatical treatises.

source: མཇལ་དཀའ་བ་རྣམས་ཀྱང་ཚིག་སོ་སོར་ཕྲལ་ནས་གཏན་ཚིགས་ཀྱིས་བཤད་དེ་གཞུང་དུ་བྲིས།
en: “Difficult terms have been divided into individual parts that have logical explanations and codified as such.

source: སྐད་རྐྱང་པ་བཤད་མི་འཚལ་བ་སྒྲ་བཞིན་དུ་བསྒྱུར་བར་རིགས་པ་རྣམས་ཀྱང་སྒྲ་བཙན་པར་བགྱིས་ཏེ་མིང་དུ་བཏགས།
en: Those simple terms that require no explanation and are suitable to be translated literally have been assigned direct correspondences.

source: སྐད་ཁ་ཅིག་དོན་བཞིན་དུ་གདགས་པར་རིགས་པ་རྣམས་ཀྱང་དོན་བཙན་པར་བགྱིས་ཏེ་མིང་དུ་བཏགས་ནས་བཙན་པོའི་སྤྱན་སྔར་བནྡེ་ཆེན་པོ་ཡོན་ཏན་འོད་དང་།
en: For other terms, it has been appropriate to assign a correspondence on the basis of meaning.

source: བནྡེ་ཆེན་པོ་ཏིང་ངེ་འཛིན་ལ་སོགས་པ་ཡང་འཚོགས་ཏེ་རྗེ་བློན་གདན་འཛོམ་པ་ལ་ཞུས་ནས་དྷརྨ་བསྒྱུར་བའི་ཐབས་དང་། རྒྱ་གར་གྱི་སྐད་ལ་བོད་ཀྱི་སྐད་དུ་མིང་གདགས་པ་རྣམས་གཏན་ལ་ཕབ་སྟེ་བཀས་བཅད་པ།
en: “Then, the grand monk Yönten, the grand monk Tingézin, and others gathered before the emperor, and having submitted it to the lord and his assembled ministers, the methodology for translating the Dharma, and the Sanskrit-Tibetan correspondences, were finalized and issued as an official decree.”

source: ཞེས་འབྱུང་ཞིང་། དཀར་ཆག་ཆེན་མོ་དེ་དག་མཛད་པའི་སྐབས་སུ་གསང་སྔགས་ནང་གི་རྒྱུད་སྡེ་ཟབ་མོ་རྣམས་གསང་ནས་སྤྱོད་པ་ཉིད་ཡིན་པའི་ཕྱིར་ཡོངས་གྲགས་སུ་ཐེམ་བྱང་དུ་མ་བཏབ་བོ། །
en: When these great inventories were being prepared, the profound inner tantras of the Secret Mantra were not publicly recorded since they concerned esoteric practices.

source: བསྟན་པ་ཕྱི་དར་གྱི་ཚེ་སྔར་གྱི་རྣམས་ཕལ་ཆེར་ཡོད་པའི་སྟེང་དུ་སྤྲུལ་པའི་ལོ་ཙཱ་བ་ཆེན་པོ་རྣམས་ཀྱིས་མདོ་རྒྱུད་མང་དུ་བསྒྱུར་ཅིང་བསྣན་པར་མཛད་པ་ཡིན་མོད་ཀྱི་རེ་ཞིག་ཕྱོགས་གཅིག་ཏུ་བསྡུས་ནས་དཀར་ཆག་འདེབས་པ་པོ་མ་བྱུང་ལ། །
en: On the Creation of the Narthang Kangyur During the period of the later diffusion of the teachings, the great emanated translators continued to translate many sūtras and tantras, adding to those that were already extant. For some time, however, there was no one to collate them and assemble a catalog.

source: ཕྱིས་མཁས་པ་བཅོམ་རལ་པའི་སློབ་མ་འཇམ་དགག་པཀྵིས་ཧོར་ཡུལ་ནས་བཀའ་འགྱུར་བཞེངས་པའི་མཐུན་རྐྱེན་གྱི་ཡོ་བྱད་མང་པོ་བསྐུར་བ་ལ་བརྟེན་ནས་འདུལ་བ་ལུང་གི་མ་ཕྱི་མཆིམས་ཆེན་པོ་ནམ་མཁའ་གྲགས་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་རྒྱ་འདུལ་བ་འཛིན་པ་ཞལ་བཞུགས་པའི་དུས་ན། དགེ་བའི་བཤེས་གཉེན་ཆེན་པོ་འདུལ་བ་འཛིན་པ་ཞིང་མོ་ཆེ་པ་བྱང་ཆུབ་སེང་གེས་གཉེར་མཛད་ནས།
en: Later on, Jamgak Pakṣi, a student of the scholar Chom Ralpa, sent many of the necessary materials from the land of Hor for the creation of the Kangyur.

source: ལུང་ཕྲན་ཚེགས་ཀྱི་བམ་པོ་བཅུ་གཉིས་མ་ཚང་བ་དང་། གཞུང་བླ་མའི་ཞུ་བ་མ་རྫོགས་པ་བམ་པོ་བཅུ་གཉིས་དང་། སྡོམ་ཚིག་ཡིག་ཚར་གཉིས་མ་ཚང་བ་རྣམས་བསམ་ཡས་མཆིམས་ཕུ་ལ་སོགས་པ་དབུས་གཙང་གི་གཙུག་ལག་ཁང་རྣམས་ནས་བཙལ་ཏེ།
en: The source texts for the Vinaya section were compiled by editing and collating the collection made by Chim Chenpo Namkha Drak and consulting the vinaya scriptures housed in the monasteries of Chumik Ringmo, Runglung Shödrok, and others.

source: ལ་སྟོད་འོལ་རྒོད་ཀྱི་གཙུག་ལག་ཁང་དུ་གནས་བརྟན་དྷརྨ་སེང་གེས་ལུང་སྡེ་བཞི་ཚང་བར་བཞེངས་པ་སྣར་ཐང་གི་གཙུག་ལག་ཁང་དུ་གདན་དྲངས་ཏེ་དེ་ལ་དཔེ་ཕྱི་མཛད་ནས་བཞེངས་པ་དང་། གཞན་ཡང་ཆུ་མིག་རིང་མོའི་གཙུག་ལག་ཁང་དང་།
en: Chim Chenpo Namkha Drak had brought to Narthang monastery a complete edition of the four vinaya scriptures produced by the venerable Dharma Sengé at the monastery of Latö Olgö during the lifetime of the vinaya specialist of Gya.

source: རུང་ཀླུང་ཤོད་གྲོག་གི་གཙུག་ལག་ཁང་གི་འདུལ་བ་ལུང་ལ་སོགས་པ་རྣམས་ལ་གཏུགས་པ་ཡིན་ཞིང་།
en: Dharma Sengé’s collection was prepared under the supervision of the vinaya specialist Shingmo Chepa Jangchup Sengé, who scoured the many monasteries of Ü and Tsang, such as Samyé Chimphu and so forth, and found incomplete versions of The Finer Points of Discipline in twelve volumes, The Preeminent Account of Discipline in twelve volumes, and two volumes concerning vows.

source: མདོ་མང་གི་སྐོར་རྣམས་ཀྱི་མ་ཕྱི་འགྲོ་མགོན་ཆོས་རྒྱལ་འཕགས་པའི་ཐུགས་དམ་རྟེན་ལྷ་མིའི་རྒྱན་མཆོག་ཏུ་གྲགས་པ་དང་།
en: The source texts for the Sūtra section were compiled by comparing a large number of well-organized sūtra collections, including the personal practice support of Drogön Chögyal Phakpa, known as The Supreme Ornament of Gods and Men;

source: གཙང་ཆུ་མིག་རིང་མོའི་གཙུག་ལག་ཁང་གི་མདོ་མང་རྣམས་ཀྱི་ནང་ནས་མཆོག་ཏུ་གྱུར་པ་དགེ་བའི་བཤེས་གཉེན་འདར་ཕྱར་གྱིས་བཞེངས་པའི་མདོ་མང་འདར་ཕྱིར་མ་ཞེས་གྲགས་པ་དང་། འབྲང་མཚམས་ཕུག་ཆུང་མ་ཞེས་གྲགས་པ་དང་། དགའ་འབར་མ་ཞེས་གྲགས་པ་དང་།
en: the finest among the sūtra collections housed at Chumik Ringmo monastery in Tsang, such as the collections compiled by Geshé Darchar known as The Sūtra Collection of Darchar, The Drang Tsamphuk Chungma Collection, and The Blazing Joy Collection;

source: དཔལ་སྣར་ཐང་གི་གཙུག་ལག་ཁང་གི་མདོ་མང་རྣམས་ཀྱི་མཆོག་ཏུ་གྱུར་པ་མཁན་པོ་ཆེན་པོ་མཆིམས་ཀྱི་ཐུགས་དམ་མདོ་མང་གསེར་གཞུང་མ་དང་། ཕྱུག་རྒྱལ་མ་དང་། དགོན་གསར་མ་ལ་སོགས་པ་རྣམས་དང་།
en: the finest among the sūtras housed at glorious Narthang monastery, such as the practice support of Khenchen Chim, The Golden Scripture Sūtra Collection, as well as The Riches of the Victor Collection, The New Monastery Collection, and others;

source: གཞན་ཡང་བླ་མ་གྲུ་སྤང་རྩ་བའི་ཐུགས་དམ་མདོ་མང་འཛམ་གླིང་རྒྱན་དང་།
en: the practice support of Lama Drupang Tsawa called The Sūtra Collection to Adorn the World;

source: ཤོག་ཆུང་གི་གཙུག་ལག་ཁང་གི་མདོ་མང་དྲུག་ཅུ་རྩ་གཉིས་དུ་མ་དང་།
en: The Sūtra Collection in Sixty-Two Parts from Shokchung temple;

source: སྤུན་གསུམ་གྱི་གཙུག་ལག་ཁང་གི་མདོ་མང་དང་།
en: the sūtra collection of Pünsum temple;

source: ཞ་ལུ་གསེར་ཁང་གི་གཙུག་ལག་ཁང་གི་མདོ་མང་གཞི་མ་དང་།
en: the sūtra collections of the golden chapel of Zhalu known as The Essential Sūtra Collection and The Mönda Dho Collection;

source: སྨོན་ད་རྡོ་ཞེས་གྲགས་པ་ལ་སོགས་པ་མདོ་སྣ་མང་ཞིང་གོ་རིམ་ལེགས་པ་རྣམས་དང་བསྟུན་པ་དང་། ཤེར་ཕྱོགས་འབུམ་ལ།
en: and others.
